Tekla Open API Reference for Tekla Structures 2025
Picker.PickObjects Method (Picker.PickObjectsEnum)
 Queries the user to pick model objects from the model.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModelObjectEnumerator PickObjects(
	Picker.PickObjectsEnum Enum
)
Public Function PickObjects (
	Enum As Picker.PickObjectsEnum
) As ModelObjectEnumerator
Parameters
Enum
Type: Tekla.Structures.Model.UI.Picker.PickObjectsEnum
Indicates the type and amount of objects to pick.
Return Value
Type: ModelObjectEnumerator
An enumerator of model object instances.
See Also
Reference
Picker Class
PickObjects Overload
Tekla.Structures.Model.UI Namespace